##############################################################
##              Physical synthesis commands                 ##
## Generated by Fernando Moraes - 19/agosto/2016            ##
## GAPH/FACIN/PUCRS                                         ##
## innovus -common_ui  and source this file                 ##
##############################################################

###############################
# Step 1: Reading In the Design
###############################

set_db init_power_nets {VDD vdd vdd!}
set_db init_ground_nets {VSS GND gnd gnd!}
source layout/TF.invs_setup.tcl


###############################
# Step 2: Floorplanning
###############################

create_floorplan -site CORE -core_density_size 2 0.8 4 4 4 4 
gui_fit


###############################
# Step 3: Power Planning
###############################

##Generate / connect global nets (VDD/GND)
delete_global_net_connections
connect_global_net vdd -type pg_pin -pin_base_name vdd -inst_base_name *
connect_global_net gnd -type pg_pin -pin_base_name gnd -inst_base_name *
connect_global_net vdd -type pg_pin -pin_base_name vdd! -inst_base_name *
connect_global_net gnd -type pg_pin -pin_base_name gnd! -inst_base_name *
connect_global_net vdd -type tie_hi -inst_base_name *
connect_global_net gnd -type tie_lo -inst_base_name *


#Generate power ring. Use M1 for horizontal and M2 for vertical
add_rings -spacing 0.25 -width 0.5 -layer {top M1 bottom M1 left M2 right M2} -jog_distance 2.5 -offset 1.5 -nets {gnd vdd} -threshold 2.5


#Route power rails using M1 
route_special -connect {block_pin core_pin pad_pin pad_ring floating_stripe} -layer_change_range {M1 AP} -block_pin_target {nearest_target} -pad_pin_port_connect {all_port one_geom} -block_pin {use_lef} -allow_jogging 1  -crossover_via_layer_range {M1 AP} -allow_layer_change 1 -target_via_layer_range {M1 AP} -nets {gnd vdd} 

###############################
# Step 4: Place
###############################
place_design -no_pre_place_opt
gui_fit


###############################
# Step 5: Route and Verify
###############################
route_design -global
route_detail


###############################
# Step 6: Fill empty spaces
###############################
add_fillers -base_cells HS65_GS_FILLERPFP4 HS65_GS_FILLERPFP3 HS65_GS_FILLERPFP2 HS65_GS_FILLERPFP1 -prefix FILLER


check_design -all

check_drc

report_summary -out_dir summaryReport
